---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.DisjoinedSolidsInInPlaceFamily
source: html/1b474262-8b56-a5f0-9ecb-ffe07afd8732.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.DisjoinedSolidsInInPlaceFamily Property

In-place family contains multiple disjoined solids. Consider splitting in several in-place families.

## Syntax (C#)
```csharp
public static FailureDefinitionId DisjoinedSolidsInInPlaceFamily { get; }
```